InformationRegisters/ПлановоеЗначениеПроектирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановоеЗначениеПроектирования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВКалендарных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВРабочих</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланРазработкиВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДниНедели</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОповещениеПоE_mail.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОповещениеПоE_mail</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтчетыБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияОповещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>E_mail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омРегламент/Ext/Module.bsl
Процедура ИзменениеначалаПлановыхЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановоеЗначениеПроектированияСрезПоследних.Задача КАК Задача,
	|	ПлановоеЗначениеПроектированияСрезПоследних.ПланРазработкиВДнях КАК ПланРазработкиВДнях
	|ИЗ
	|	РегистрСведений.ПлановоеЗначениеПроектирования.СрезПоследних КАК ПлановоеЗначениеПроектированияСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
	|		ПО ПлановоеЗначениеПроектированияСрезПоследних.Задача = ТаймингЗадачСрезПоследних.Задача
	|ГДЕ
	|	ТаймингЗадачСрезПоследних.Состояние = &Состояние
	|	И ТаймингЗадачСрезПоследних.ТипЗадачи В(&ТипЗадачи)
	|	И ПлановоеЗначениеПроектированияСрезПоследних.ДатаНачала < &ДатаНачала";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗадач.ОжиданиеКонструктором);
	Запрос.УстановитьПараметр("ТипЗадачи", омЗадачиПКДПовтор.ТипыЗадачКонструктора());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Автор 		= ПараметрыСеанса.ТекущийПользователь;
	ТД 			= ТекущаяДата();
	ТДНД		= НачалоДня(ТекущаяДата());
	Комментарий = "Регламентное задание";
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период				= ТД;
		МенеджерЗаписи.Автор 				= Автор;
		МенеджерЗаписи.ДатаНачала 			= ТДНД;
		МенеджерЗаписи.Задача 				= Выборка.Задача;
		МенеджерЗаписи.ПланРазработкиВДнях  = Выборка.ПланРазработкиВДнях;
		МенеджерЗаписи.Комментарий			= Комментарий;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапускОчередиPDM() Экспорт 
	омPDMНаСервере.ПроверитьОчередьИЗапуститьСкрипт();
КонецПроцедуры

Процедура РасчетТабеля() Экспорт
	омТабельНаСервере.РасчетТабеляЗаПериод();	
КонецПроцедуры

Процедура ЗапускОчередиPDM_API() Экспорт
	
	омФайлыPDM.КонтрольДлительныхДействий();	
	
КонецПроцедуры

Процедура ОповещениеПоEMail() Экспорт

	ТД = ТекущаяДата();
	
	ВремяК = Дата(1, 1, 1, Час(ТД), Минута(ТД), 1); 
	ВремяН = ВремяК - 90; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОповещениеПоE_mailРасписание.Ссылка КАК Оповещение,
		|	ОповещениеПоE_mailРасписание.Ссылка.ИспользоватьОтчет КАК ИспользоватьОтчет,
		|	ОповещениеПоE_mailРасписание.Ссылка.СобытиеОповещения КАК СобытиеОповещения,
		|	ОповещениеПоE_mailРасписание.Ссылка.УчетнаяЗапись КАК УчетнаяЗапись,
		|	ОповещениеПоE_mailРасписание.Ссылка.Шаблон КАК Шаблон,
		|	ОповещениеПоE_mailРасписание.Ссылка.Тема КАК Тема,
		|	ОповещениеПоE_mailАдреса.E_mail КАК E_mail,
		|	ОповещениеПоE_mailАдреса.Представление КАК ПредставлениеE_mail
		|ИЗ
		|	Справочник.ОповещениеПоE_mail.Расписание КАК ОповещениеПоE_mailРасписание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОповещениеПоE_mail.Адреса КАК ОповещениеПоE_mailАдреса
		|		ПО ОповещениеПоE_mailРасписание.Ссылка = ОповещениеПоE_mailАдреса.Ссылка
		|ГДЕ
		|	ОповещениеПоE_mailРасписание.ДеньНедели = &ДеньНедели
		|	И ОповещениеПоE_mailРасписание.Время МЕЖДУ &ВремяН И &ВремяК
		|	И НЕ ОповещениеПоE_mailРасписание.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Оповещение";
	
	Запрос.УстановитьПараметр("ВремяК", 	ВремяК);
	Запрос.УстановитьПараметр("ВремяН", 	ВремяН);
	Запрос.УстановитьПараметр("ДеньНедели", ПолучитьПеречислениеДеньНедели());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекущиеОповещение 	= Неопределено;
	СтруктураПараметров = омВзаимодействиеСервер.ПолучитьСтруктуруДляОтправкиПисьма();
	МассивЕмайлов 		= Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		Если НЕ ТекущиеОповещение = Выборка.Оповещение Тогда
			
			Если НЕ ТекущиеОповещение = Неопределено Тогда
				омВзаимодействиеСервер.ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов);	
			КонецЕсли;
			
			ТекущиеОповещение = Выборка.Оповещение;
			ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка);
			МассивЕмайлов = Новый Массив;
			
		КонецЕсли;	
		
		МассивЕмайлов.Добавить(Новый Структура("E_mail, ПредставлениеE_mail", Выборка.E_mail, Выборка.ПредставлениеE_mail));
		
	КонецЦикла;
	
	Если НЕ ТекущиеОповещение = Неопределено Тогда
		омВзаимодействиеСервер.ОтправитьСообщение(СтруктураПараметров, МассивЕмайлов);	
	КонецЕсли;
		
КонецПроцедуры 

Функция ПолучитьПеречислениеДеньНедели(ТД = Неопределено) Экспорт

    Если ТД = Неопределено Тогда
		НомерНедели = ДеньНедели(ТекущаяДата());	
	Иначе
		НомерНедели = ДеньНедели(ТД);	
	КонецЕсли;
	
	Если НомерНедели = 1 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Понедельник;
	ИначеЕсли НомерНедели = 2 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Вторник;
	ИначеЕсли НомерНедели = 3 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Среда;
	ИначеЕсли НомерНедели = 4 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Четверг;
	ИначеЕсли НомерНедели = 5 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Пятница;
	ИначеЕсли НомерНедели = 6 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Суббота;
	ИначеЕсли НомерНедели = 7 Тогда
		ЗначениеДнянедели = Перечисления.ДниНедели.Воскресение;
	КонецЕсли;
	
	Возврат ЗначениеДнянедели;

КонецФункции // ПолучитьПеречислениеДеньНедели()
